# Pandas

Pandas is a library written in Python which allows us to transform, analyze, load, and export data.

The first thing that we need to do in order to work with Pandas, is to install that library.

In our case, this enviroment (Jupyter labs) has this library already installed.

To install this library we would need to execute this command on a terminal.

```
$ pip3 install pandas
```

## Serial

Is an ordered sequence of values... almost the same as a list.

But:

- We cannot mix datatypes inside a Serial... All the values need to be of the same nature (datatype)
- In addition ... we have a bunch of extra functions 

It is like a Column in a relational database table.

## DataFrame

Is a collection of Serials... Like a table in a database

In [1]:
# First thing after installing this library... we need to import it

import pandas as pd

## Creating a Dataframe

We could get a Dataframe from a database... or Excel document... but we can create a new/empty one right using pandas.

In [2]:
my_new_empty_dataframe = pd.DataFrame()
print(my_new_empty_dataframe)

Empty DataFrame
Columns: []
Index: []

In [3]:
names = ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" )
names_dataframe = pd.DataFrame(names)
print(names_dataframe)

           0
0       Ivan
1  Francisca
2  Francisco
3     Helena
4    Juliana

In [4]:
names_dataframe.columns

RangeIndex(start=0, stop=1, step=1)

In [6]:
names_dataframe.columns = ["Surname"]

In [7]:
names_dataframe.columns

Index(['Surname'], dtype='object')

In [8]:
names_dataframe

     Surname
0       Ivan
1  Francisca
2  Francisco
3     Helena
4    Juliana

In [9]:
names = ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" )
new_names_dataframe = pd.DataFrame(names, columns = ["Surname"])
new_names_dataframe

     Surname
0       Ivan
1  Francisca
2  Francisco
3     Helena
4    Juliana

In [12]:
people = ( ("Ivan",43) , ("Francisca", 28 ) , ("Francisco", 29) , ("Helena",30) , ("Juliana", 27) )
people_dataframe = pd.DataFrame(people , columns = ["Surname", "Age"])
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [15]:
# Retrive 1 single column
people_dataframe['Age']

0    43
1    28
2    29
3    30
4    27
Name: Age, dtype: int64

In [16]:
people_dataframe.iloc[2]

Surname    Francisco
Age               29
Name: 2, dtype: object

In [17]:
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [18]:
people_dataframe.index= people_dataframe['Surname']
people_dataframe

             Surname  Age
Surname
Ivan            Ivan   43
Francisca  Francisca   28
Francisco  Francisco   29
Helena        Helena   30
Juliana      Juliana   27

In [19]:
people_dataframe.loc["Francisco"]

Surname    Francisco
Age               29
Name: Francisco, dtype: object

In [20]:
people_dataframe.loc["Francisco"]['Age']

29

In [21]:
people_dataframe['Age'].loc["Francisco"]

29

In [22]:
people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      (43, 28, 29, 30, 27)
}

people_dataframe = pd.DataFrame(people )
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [23]:
people_dataframe.shape

(5, 2)

In [24]:
people_dataframe.shape[0] # This is the number of rows
people_dataframe.shape[1] # This is the number of columns

2

In [25]:
people_dataframe.size    # The total amount of data (values) rows x columns

10

In [26]:
people_dataframe.head(2)  # The first 2 rows

     Surname  Age
0       Ivan   43
1  Francisca   28

In [27]:
people_dataframe.tail(2)  # The last 2 rows

   Surname  Age
3   Helena   30
4  Juliana   27

In [30]:
# Loop thru all the values in my dataframe

for each_index in people_dataframe.index:
#    print(each_index)
    print(people_dataframe.iloc[each_index])

Surname    Ivan
Age          43
Name: 0, dtype: object
Surname    Francisca
Age               28
Name: 1, dtype: object
Surname    Francisco
Age               29
Name: 2, dtype: object
Surname    Helena
Age            30
Name: 3, dtype: object
Surname    Juliana
Age             27
Name: 4, dtype: object

In [31]:

for each_column in people_dataframe.columns:
    print(people_dataframe[each_column])

0         Ivan
1    Francisca
2    Francisco
3       Helena
4      Juliana
Name: Surname, dtype: object
0    43
1    28
2    29
3    30
4    27
Name: Age, dtype: int64

In [32]:
for each_index in people_dataframe.index:
    for each_column in people_dataframe.columns:
        print(people_dataframe[each_column].iloc[each_index])

Ivan
43
Francisca
28
Francisco
29
Helena
30
Juliana
27

for each_column in people_dataframe.columns:
    for each_index in people_dataframe.index:
        print(people_dataframe[each_column].iloc[each_index])

# Pandas summary

## In order to use pandas:

- We need to install it `pip3 install pandas`
- Then we need to import pandas: `import pandas as pd`

## We can create new Dataframes (Like tables):
- `my_new_dataframe = pd.DataFrame( some_data )`

  Where some_data can be:
  - Tuple
  - Tuple of tuples
  - Dictionary

## Properties:

- `my_dataframe.shape`. This returns a tuple with the number of rows and columns
- `my_dataframe.size`.  This returns the number of cells = number of rows by the number of columns
- `my_dataframe.index`.  This returns or assigns the values to be used as ids (for the rows=
- `my_dataframe.columns`.  This returns or assigns the names of columns

## Recover data

- `my_dataframe[ 'name_of_a_column' ]`.        This returns or assigns a column
- `my_dataframe.iloc[ numeric_id_of_a_row ]`.  This returns or assigns a row
- `my_dataframe.loc[ 'text_id' ]`.             This returns or assigns a row
- `my_dataframe[ 'name_of_a_column' ].iloc[ id ]`.  This returns or assigns a data (cell)
- `my_dataframe.iloc[ id ][ 'name_of_a_column' ]`.  This returns or assigns a data (cell)

## Loop thru all the rows/columns within a dataframe

```
for each_column in my_dataframe.columns:
    my_dataframe[each_column]
```
```
for each_id in my_dataframe.index:
    my_dataframe.iloc[each_id]
```

In [34]:
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [37]:
people_dataframe['Age']
people_dataframe.iloc[3]

Surname    Helena
Age            30
Name: 3, dtype: object

In [38]:
people_dataframe.index = people_dataframe['Surname']

In [39]:
people_dataframe

             Surname  Age
Surname
Ivan            Ivan   43
Francisca  Francisca   28
Francisco  Francisco   29
Helena        Helena   30
Juliana      Juliana   27

In [41]:
people_dataframe.loc['Helena']

Surname    Helena
Age            30
Name: Helena, dtype: object

In [42]:
people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      (43, 28, 29, 30, 27)
}

people_dataframe = pd.DataFrame(people )
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [44]:
people_dataframe['Age'].iloc[3]

30

In [46]:
people_dataframe.iloc[3]['Age']

30

In [51]:
for each_id in people_dataframe.index:
    print(people_dataframe.iloc[each_id])

Surname    Ivan
Age          43
Name: 0, dtype: object
Surname    Francisca
Age               28
Name: 1, dtype: object
Surname    Francisco
Age               29
Name: 2, dtype: object
Surname    Helena
Age            30
Name: 3, dtype: object
Surname    Juliana
Age             27
Name: 4, dtype: object

In [53]:
for each_column_name in people_dataframe.columns:
    print(people_dataframe[each_column_name])

0         Ivan
1    Francisca
2    Francisco
3       Helena
4      Juliana
Name: Surname, dtype: object
0    43
1    28
2    29
3    30
4    27
Name: Age, dtype: int64

In [57]:

for each_id in people_dataframe.index:
    #each_id   0 1 2 3 4
    for each_column_name in people_dataframe.columns:
        #each_column_name Surname  Age
        #     people_dataframe['Age'].iloc[3]
        value = people_dataframe[each_column_name].iloc[each_id]
        print("Value at row: " + str(each_id) + " and column: " + each_column_name + " -- "+ str(value))

Value at row: 0 and column: Surname -- Ivan
Value at row: 0 and column: Age -- 43
Value at row: 1 and column: Surname -- Francisca
Value at row: 1 and column: Age -- 28
Value at row: 2 and column: Surname -- Francisco
Value at row: 2 and column: Age -- 29
Value at row: 3 and column: Surname -- Helena
Value at row: 3 and column: Age -- 30
Value at row: 4 and column: Surname -- Juliana
Value at row: 4 and column: Age -- 27

In [58]:
# SELECT Surname, Age FROM People;
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [63]:
# Age -> OlderThan20

def olderThan30(age):
    return age >= 30

people_dataframe['OlderThan30'] = people_dataframe['Age'].apply(olderThan30)

In [64]:
people_dataframe

     Surname  Age  OlderThan30
0       Ivan   43         True
1  Francisca   28        False
2  Francisco   29        False
3     Helena   30         True
4    Juliana   27        False

In [65]:


people_dataframe['OlderThan30_Version2'] = people_dataframe['Age'].apply(lambda age: age >= 30)
people_dataframe

     Surname  Age  OlderThan30  OlderThan30_Version2
0       Ivan   43         True                  True
1  Francisca   28        False                 False
2  Francisco   29        False                 False
3     Helena   30         True                  True
4    Juliana   27        False                 False

In [67]:
people_dataframe['Age'] >= 30

0     True
1    False
2    False
3     True
4    False
Name: Age, dtype: bool

In [68]:
people_dataframe['Age'].apply(lambda age: age >= 30)

0     True
1    False
2    False
3     True
4    False
Name: Age, dtype: bool

In [69]:
people_dataframe['Age'].apply( lambda age: age + 20 )

0    63
1    48
2    49
3    50
4    47
Name: Age, dtype: int64

In [70]:
people_dataframe['Age'] + 20

0    63
1    48
2    49
3    50
4    47
Name: Age, dtype: int64

# Filtering data

In [71]:
# people_dataframe[ boolean_column ]

people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      (43, 28, 29, 30, 27)
}

people_dataframe = pd.DataFrame(people )
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [73]:
filter = ( True , False , True, True, False )

filter_dataframe = pd.DataFrame(filter )
filter_dataframe[0]

0     True
1    False
2     True
3     True
4    False
Name: 0, dtype: bool

In [74]:
people_dataframe [ filter_dataframe[0] ]

     Surname  Age
0       Ivan   43
2  Francisco   29
3     Helena   30

In [75]:
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [76]:
people_dataframe['Age'] >= 30

0     True
1    False
2    False
3     True
4    False
Name: Age, dtype: bool

In [77]:
people_dataframe[ people_dataframe['Age'] >= 30 ]

  Surname  Age
0    Ivan   43
3  Helena   30

In [78]:
# Practice 1

people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      (43, 28, 29, 30, 27)
}

people_dataframe = pd.DataFrame(people )
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [81]:
new_column = people_dataframe['Surname'].apply(lambda text: text.upper() )

In [82]:
new_column

0         IVAN
1    FRANCISCA
2    FRANCISCO
3       HELENA
4      JULIANA
Name: Surname, dtype: object

In [83]:
people_dataframe['Surname'] = new_column
people_dataframe

     Surname  Age
0       IVAN   43
1  FRANCISCA   28
2  FRANCISCO   29
3     HELENA   30
4    JULIANA   27

In [84]:
new_column = people_dataframe['Surname'].apply(lambda text: text.capitalize() )
people_dataframe['Surname'] = new_column
people_dataframe

     Surname  Age
0       Ivan   43
1  Francisca   28
2  Francisco   29
3     Helena   30
4    Juliana   27

In [87]:
# Practice 2 : FILTER 

# I just want the rows ... which surname contains the char 'c'

filter = people_dataframe['Surname'].apply(lambda value: value.count("c") > 0 )
people_dataframe[filter]

     Surname  Age
1  Francisca   28
2  Francisco   29